In [1]:
import pandas as pd

# clipboard
   A B C D
aa 1 2 3 4
bb 5 6 7 8

In [8]:
copied_clipboard_data=pd.read_clipboard()
copied_clipboard_data

    A  B  C  D
aa  1  2  3  4
bb  5  6  7  8

In [10]:
type(copied_clipboard_data)

pandas.core.frame.DataFrame

In [13]:
my_new_dataframe=pd.DataFrame({"Name":["Divya","Rahul","Vinayak"], "Age":[10,20,30], "City":["Chandigarh","Mohali","Panchkula"]})
my_new_dataframe

      Name  Age        City
0    Divya   10  Chandigarh
1    Rahul   20      Mohali
2  Vinayak   30   Panchkula

In [16]:
my_new_dataframe.to_clipboard()

In [20]:
pd.read_clipboard()

                Country of birth Population
0  United Kingdom United Kingdom  5,175,677
1                    India India    262,247
2                  Poland Poland    158,300
3    Republic of Ireland Ireland    129,807
4                Nigeria Nigeria    114,718
5              Pakistan Pakistan    112,457
6          Bangladesh Bangladesh    109,948
7                Jamaica Jamaica     87,467
8            Sri Lanka Sri Lanka     84,542
9                  France France     66,654

In [21]:
#where()

In [24]:
my_series=pd.Series([10,20,30,40,50,10,22,33,44,55,66,4,5,6,2,1,0,0])
my_series

0     10
1     20
2     30
3     40
4     50
5     10
6     22
7     33
8     44
9     55
10    66
11     4
12     5
13     6
14     2
15     1
16     0
17     0
dtype: int64

In [26]:
my_series<30

0      True
1      True
2     False
3     False
4     False
5      True
6      True
7     False
8     False
9     False
10    False
11     True
12     True
13     True
14     True
15     True
16     True
17     True
dtype: bool

In [28]:
my_series[my_series<30]

0     10
1     20
5     10
6     22
11     4
12     5
13     6
14     2
15     1
16     0
17     0
dtype: int64

In [29]:
my_series.where(my_series<30)
#here the shape of the original series is maintained

0     10.0
1     20.0
2      NaN
3      NaN
4      NaN
5     10.0
6     22.0
7      NaN
8      NaN
9      NaN
10     NaN
11     4.0
12     5.0
13     6.0
14     2.0
15     1.0
16     0.0
17     0.0
dtype: float64

# task 
Try where() with my_new_dataframe['Age']